title: Service Creation Detection - System Event 7045
id: 1398b2ff-43ed-4410-a870-8ecc058f517b
description: Detects the creation of a new service using System Event ID 7045, which could indicate malicious activity.
status: experimental
author: Thawd Labs
date: 2024/08/23
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
    filter_expected_location:
        ServiceFileName|contains:
            - ":windows\\system32\\"
            - ":\\Program Files\\"
            - ":\\Program Files (x86)\\"
            - "\\%systemroot%\\"
    condition: selection and not filter_expected_location
falsepositives:
    - Legitimate service installations or updates by authorized software
    - System administrators creating services as part of maintenance
level: high
tags:
    - attack.t1543.003
    - attack.t1569.002
    - attack.execution
    - attack.persistence
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-7045
